tap "gnebbia/kb", "https://github.com/gnebbia/kb.git"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Search tool like grep, but optimized for programmers
brew "ack"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Weather in your terminal, with ANSI colors and Unicode symbols
brew "ansiweather"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Console Matrix
brew "cmatrix"
# Converts Microsoft Office docx documents to equivalent text documents
brew "docx2txt"
# Useful examples at the command-line
brew "eg-examples"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Program providing model for GNU coding standards and practices
brew "hello"
# Advanced HTML-to-text converter
brew "html2text"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern replacement for ps written by Rust
brew "procs"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Minimalist knowledge base manager
brew "gnebbia/kb/kb"
