tap "homebrew/bundle"
tap "homebrew/core"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Useful examples at the command-line
brew "eg-examples"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Program providing model for GNU coding standards and practices
brew "hello"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Display directories as trees (with optional color/HTML output)
brew "tree"
tap "gnebbia/kb", "https://github.com/gnebbia/kb.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Weather in your terminal, with ANSI colors and Unicode symbols
brew "ansiweather"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Console Matrix
brew "cmatrix"
# Converts Microsoft Office docx documents to equivalent text documents
brew "docx2txt"
# Useful examples at the command-line
brew "eg-examples"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Advanced HTML-to-text converter
brew "html2text"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Minimalist knowledge base manager
brew "gnebbia/kb/kb"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
